// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
//a = 5; b = 7 -> max = 7
//a = 2 b = 10 -> max = 10
//a = -9 b = -3 -> max = -3
/*
int a;
int b;

Console.WriteLine("Введите первое число: ");
string vvod1 = Console.ReadLine()!;
a = int.Parse(vvod1);
Console.WriteLine("Введите второе число: ");
string vvod2 = Console.ReadLine()!;
b = int.Parse(vvod2);

if (a > b)
{
  Console.Write($"число {a} больше, чем {b}");
  Console.Read();
}
else
{
  Console.Write($" число {b} больше, чем {a} ");
  Console.Read();
}
*/